emojis = {
    "а": '<emoji id="5341292415309331382">🔤</emoji>',
    "б": '<emoji id="5341830523171912963">🔤</emoji>',
    "в": '<emoji id="5343627361394898839">🔤</emoji>',
    "г": '<emoji id="5343745382801225863">🔤</emoji>',
    "д": '<emoji id="5344008677181373993">🔤</emoji>',
    "е": '<emoji id="5343943011426385262">🔤</emoji>',
    "ё": '<emoji id="5343732759892346066">🔤</emoji>',
    "э": '<emoji id="5343892468251249718">🔤</emoji>',
    "є": '<emoji id="5343815730070569239">🔤</emoji>',
    "ж": '<emoji id="5344013195486968582">🔤</emoji>',
    "з": '<emoji id="5343581727367380090">🔤</emoji>',
    "и": '<emoji id="5343846735439478102">🔤</emoji>',
    "i": '<emoji id="5344066916937907497">🔤</emoji>',
    "ï": '<emoji id="5341439354730461834">🔤</emoji>',
    "й": '<emoji id="5343642483974749758">🔤</emoji>',
    "к": '<emoji id="5343885617778407982">🔤</emoji>',
    "л": '<emoji id="5344077057355694658">🔤</emoji>',
    "м": '<emoji id="5343882078725357764">🔤</emoji>',
    "н": '<emoji id="5343552650438785870">🔤</emoji>',
    "о": '<emoji id="5343918435623516872">🔤</emoji>',
    "п": '<emoji id="5341568951073653523">🔤</emoji>',
    "р": '<emoji id="5343634100198587223">🔤</emoji>',
    "с": '<emoji id="5341489283725279092">🔤</emoji>',
    "т": '<emoji id="5344025178445725517">🔤</emoji>',
    "у": '<emoji id="5341447197340747094">🔤</emoji>',
    "ф": '<emoji id="5341671214244969832">🔤</emoji>',
    "х": '<emoji id="5344037324613237055">🔤</emoji>',
    "ц": '<emoji id="5341356762509359713">🔤</emoji>',
    "ч": '<emoji id="5343612024066686781">🔤</emoji>',
    "ш": '<emoji id="5344007332856609876">🔤</emoji>ц',
    "щ": '<emoji id="5343707956456209247">🔤</emoji>',
    "ь": '<emoji id="5343596377500825400">🔤</emoji>',
    "ы": '<emoji id="5343668378332578244">🔤</emoji>',
    "ъ": '<emoji id="5341568470037317531">🔤</emoji>',
    "ю": '<emoji id="5341373697565411014">🔤</emoji>',
    "я": '<emoji id="5341280685753647495">🔤</emoji>',

    " ": '<emoji id="5341583760120890501">🔤</emoji>',

    "a": '<emoji id="5341417016605557796">🔤</emoji>',
    "b": '<emoji id="5343733352597830795">🔤</emoji>',
    "c": '<emoji id="5343723783410694402">🔤</emoji>',
    "d": '<emoji id="5343571677143907474">🔤</emoji>',
    "e": '<emoji id="5341400098729381393">🔤</emoji>',
    "f": '<emoji id="5343620687015721792">🔤</emoji>',
    "g": '<emoji id="5343708239924051439">🔤</emoji>',
    "h": '<emoji id="5341362045319134237">🔤</emoji>',
    "i": '<emoji id="5341533753816663701">🔤</emoji>',
    "j": '<emoji id="5344028820577992292">🔤</emoji>',
    "k": '<emoji id="5341731030254503634">🔤</emoji>',
    "l": '<emoji id="5343674455711299867">🔤</emoji>',
    "m": '<emoji id="5341622663934655610">🔤</emoji>',
    "n": '<emoji id="5341310286668251244">🔤</emoji>',
    "o": '<emoji id="5343704632151523687">🔤</emoji>',
    "p": '<emoji id="5341368895791973401">🔤</emoji>',
    "q": '<emoji id="5343732747007442880">🔤</emoji>',
    "r": '<emoji id="5341468959940036047">🔤</emoji>',
    "s": '<emoji id="5343569757293526864">🔤</emoji>',
    "t": '<emoji id="5341812011862872806">🔤</emoji>',
    "u": '<emoji id="5341360975872283151">🔤</emoji>',
    "v": '<emoji id="5343715515598651218">🔤</emoji>',
    "w": '<emoji id="5344040709047467394">🔤</emoji>',
    "x": '<emoji id="5341611501314655139">🔤</emoji>',
    "y": '<emoji id="5343551915999379261">🔤</emoji>',
    "z": '<emoji id="5343715030267347005">🔤</emoji>',

    "1": '<emoji id="5341709941965078057">🔤</emoji>',
    "2": '<emoji id="5341737219302374275">🔤</emoji>',
    "3": '<emoji id="5343973338190461842">🔤</emoji>',
    "4": '<emoji id="5341689768503688261">🔤</emoji>',
    "5": '<emoji id="5343876907584732279">🔤</emoji>',
    "6": '<emoji id="5343966680991154511">🔤</emoji>',
    "7": '<emoji id="5343977207955996846">🔤</emoji>',
    "8": '<emoji id="5343648703087393881">🔤</emoji>',
    "9": '<emoji id="5343645095314864674">🔤</emoji>',
    "0": '<emoji id="5341311639582949828">🔤</emoji>',

    ".":  '<emoji id="5344004313494603923">🔤</emoji>',
    ",":  '<emoji id="5343757185371356387">🔤</emoji>',
    # "!!!":'<emoji id="5344032677458623639">🔤</emoji>',
    # "!?": '<emoji id="5343678527340295857">🔤</emoji>',
    "!":  '<emoji id="5341480122560036386">🔤</emoji>',
    "?":  '<emoji id="5341566528712098586">🔤</emoji>',
    "(":  '<emoji id="5343892360877063778">🔤</emoji>',
    ")":  '<emoji id="5344068029334436860">🔤</emoji>',
    "[":  '<emoji id="5343982061269042552">🔤</emoji>',
    "]":  '<emoji id="5341486964442937972">🔤</emoji>',
    "{":  '<emoji id="5341520765835559864">🔤</emoji>',
    "}":  '<emoji id="5341333204613744155">🔤</emoji>',
    "–":  '<emoji id="5343813775860451503">🔤</emoji>',
    ":":  '<emoji id="5343778965150519339">🔤</emoji>',
    ";":  '<emoji id="5343570938409533732">🔤</emoji>',
    "-":  '<emoji id="5341432633106644891">🔤</emoji>',
    "+":  '<emoji id="5341794685964795794">🔤</emoji>',
    "=":  '<emoji id="5343558263961042889">🔤</emoji>',
    "'":  '<emoji id="5343654874955398935">🔤</emoji>',
    '"':  '<emoji id="5344071237675008040">🔤</emoji>',
    "<":  '<emoji id="5341686680422204293">🔤</emoji>',
    ">":  '<emoji id="5343869348442291856">🔤</emoji>',
    "_":  '<emoji id="5341686787796388789">🔤</emoji>',
    "*":  '<emoji id="5341317132846119370">🔤</emoji>',
    "#":  '<emoji id="5343530857774726828">🔤</emoji>',
    "&":  '<emoji id="5343866496584006979">🔤</emoji>',
    "@":  '<emoji id="5344057798722337429">🔤</emoji>',
    "/":  '<emoji id="5341529729432306385">🔤</emoji>',
    "\\": '<emoji id="5341433238697036262">🔤</emoji>',
    "^":  '<emoji id="5344015708042837398">🔤</emoji>',
    "%":  '<emoji id="5343571320661622394">🔤</emoji>',
    "`":  '<emoji id="5343918293889601150">🔤</emoji>',
    "|":  '<emoji id="5343718844198305366">🔤</emoji>',
    "€":  '<emoji id="5343986828682737758">🔤</emoji>',
    "$":  '<emoji id="5343796767789957111">💲</emoji>',
    # "🤍":'<emoji id="5341506725587467798">🤍</emoji>',
}

from utils import (
    Cmd, helplist,
    Module, Command, Argument as Arg,
    get_group,
)
from pytimeparse.timeparse import timeparse

cmd = Cmd(get_group())

helplist.add_module(
    Module('emjwrite',
        description="ТОЛЬКО ТЕЛЕГРАМ ПРЕМИУМ!\n\nПишет текст рукописным шрифтом через премиум емодзи",
        author='@RimMirK'
    ).add_command(
        Command('et', [Arg('текст/ответ/цитата')], 'написать текст рукописным шрифтом через премиум емодзи')
    )
)

@cmd('et')
async def _et(_, msg):
    if len(msg.text.split()) > 1:
        text = msg.text.split(maxsplit=1)[1]

    r = msg.reply_to_message

    t = (text or msg.quote_text or getattr(r, 'text')).lower() 
    tr = t.maketrans(emojis)
    t = t.translate(tr)

    await msg.edit(t)
